// 1. Створити html-сторінку і вказати в ній посилання на файл, що містить код JS.
const dialogue = () => {
    // 2. У файлі .js створити масив від 1 до n (кількість студентів у групі) та 
    //    заповнити його. Для вводу даних використати модальне вікно promt
    const n = window.prompt('Введіть кількість студентів у групі', 1);
    if (!n) {
        window.alert('Користувач скасував введення даних');
        return;
    }
    const students = new Array(n);
    for (let i = 0; i < n; ++i) {
        const studentName = window.prompt(`Введіть імʼя студента №${i + 1}`, '');
        if (!studentName) {
            window.alert(`Користувач скасував введення даних`);
            return;
        }
        students[i] = studentName;
    }

    // 3. Ввести значення свого номера у списку групи. 
    //    Для вводу даних використати модальне вікно promt
    const studentN = window.prompt('Введіть ваш номер у списку групи', 0);
    if (studentN === 0) {
        window.alert('Користувач скасував введення даних');
        return;
    }

    // 4. Розрахувати кількість студентів у списку перед вами та після вас.
    //    Вивести у повідомлення ці значення. Для виведення даних
    //    використати модальне вікно alert.
    const beforeN = studentN - 1;
    window.alert(`Кількість студентів перед вами за списком - ${beforeN}`);
    const afterN = n - studentN;
    window.alert(`Кількість студентів після вас за списком - ${afterN}`);

    // 5. Розрахувати кількість студентів у групі не враховуючи вас
    //    (використовуючи значення із пункту 4). Вивести у повідомлення ці
    //    значення. Для виведення даних використати модальне вікно alert.
    const totalExceptUser = beforeN + afterN;
    window.alert(`Кількість студентів у групі, не враховуючи вас - ${totalExceptUser}`);

    // 6. Додати до результату з пункту 5 значенням ‘10’ з типом даних ‘string’.
    //    Вивести результат додавання у модальне вікно confirm та запитати
    //    користувача «Ви зрозуміли чому результат додавання саме такий?».
    //    При натисканні ok користувач має отримати повідомлення «Добре»,
    //    при натисканні cancel - запропонувати користувачу передивитись
    //    лекційний матеріал.
    const addedString = totalExceptUser + '10';
    window.alert(
        `При додаванні до кількості студентів числа '10' з типом даних string, ми отримаємо: ${addedString}`
    );
    const response = window.confirm('Ви зрозуміли, чому результат додавання саме такий?');
    if (response) {
        window.alert('Добре!');
    } else {
        window.alert('Передивіться минулу лекцію');
    }

    // 7. Виконати арифметичні дії віднімання, ділення та множення між
    //    значенням з пункту 5 та значенням ‘10’ з типом даних ‘string’ та
    //    вивести результат у консоль браузера. Висновки з пунктів 6 та 7
    //    записати у звіт.
    const subtract = totalExceptUser - '10';
    console.log(`Результат віднімання ${totalExceptUser} та рядка '10' - ${subtract}`);
    const division = totalExceptUser / '10';
    console.log(`Результат ділення ${totalExceptUser} та рядка '10' - ${division}`);
    const multiplication = totalExceptUser * '10';
    console.log(`Результат множення ${totalExceptUser} та рядка '10' - ${multiplication}`);
}

dialogue();

